Revit 2025 API
ParameterTypeId.RebarElemHookEndOrient Property
 "Hook Orientation At End"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static ForgeTypeId RebarElemHookEndOrient { get; }
Public Shared ReadOnly Property RebarElemHookEndOrient As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarElemHookEndOrient {
	ForgeTypeId^ get ();
}
static member RebarElemHookEndOrient : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace